In [2]:
import numpy as np
import pandas as pd

ranking = pd.read_html('https://finance.naver.com/item/sise.naver?code=005930', encoding='euc-kr'
)
ranking

[                    0                                        1  \
 0  전일  58,600  58,600  고가  59,00059,000  (상한가  76,10076,100  )
 1    시가  58,70058,700        저가  58,30058,300  (하한가  41,100  )

                             2
 0   거래량  9,587,027  9,587,027
 1  거래대금  561,574  561,574  백만  ,
            0            1       2           3
 0        현재가        58800    매도호가       58900
 1       전일대비      상승  200    매수호가       58800
 2     등락률(%)       +0.34%     전일가       58600
 3        거래량      9587027      시가       58700
 4   거래대금(백만)       561574      고가       59000
 5        액면가         100원      저가       58300
 6        NaN          NaN     NaN         NaN
 7        상한가        76100    전일상한       78000
 8        하한가        41100    전일하한       42000
 9        PER         8.92     EPS        6593
 10    52주 최고        80800  52주 최저       55700
 11      시가총액  3,510,232억원   상장주식수  5969782550
 12     외국인현재  2,972,910천주     자본금   778,046백만,
         매도잔량     매도호가  Unnamed: 2     매수호가      매수잔량
 0        NaN      NaN         NaN      NaN       NaN
 1    55082.0  59300.0         NaN      NaN       NaN
 2    57967.0  59200.0         NaN      NaN       NaN
 3    70997.0  59100.0         NaN      NaN       NaN
 4   103439.0  59000.0         NaN      NaN       NaN
 5    31618.0  58900.0         NaN      NaN       NaN
 6        NaN      NaN         NaN      NaN       NaN
 7        NaN      NaN         NaN      NaN       NaN
 8        NaN      NaN         NaN      NaN       NaN
 9        NaN      NaN         NaN  58800.0   77849.0
 10       NaN      NaN         NaN  58700.0  118921.0
 11       NaN      NaN         NaN  58600.0  230168.0
 12       NaN      NaN         NaN  58500.0  141146.0
 13       NaN      NaN         NaN  58400.0  132052.0
 14       NaN      NaN         NaN      NaN       NaN,
         0     1        2
 0  420549  잔량합계  2236487,
           0              1
 0      시가총액  351조  232  억원
 1    시가총액순위         코스피 1위
 2     상장주식수     5969782550
 3  액면가l매매단위    100원  l  1주,
              0           1
 0  외국인한도주식수(A)  5969782550
 1  외국인보유주식수(B)  2972909661
 2  외국인소진율(B/A)      49.80%,
            0                  1
 0  투자의견l목표주가  4.00매수  l  80,525
 1   52주최고l최저  80,800  l  55,700,
                    0                  1
 0   PERlEPS(2022.06)   8.92배  l  6,593원
 1          추정PERlEPS  10.00배  l  6,148원
 2  PBRlBPS (2022.06)     ∞배  l  46,937원
 3      배당수익률l2021.12              2.46%,
           0       1
 0  동일업종 PER   7.97배
 1  동일업종 등락률  +0.57%,
         매도잔량 호가(20분지연)       매수잔량
 0        NaN       NaN        NaN
 1    17978.0     59800        NaN
 2    19726.0     59700        NaN
 3    18110.0     59600        NaN
 4    27020.0     59500        NaN
 5    18612.0     59400        NaN
 6    55082.0     59300        NaN
 7    57967.0     59200        NaN
 8    70997.0     59100        NaN
 9   103439.0     59000        NaN
 10   31618.0     58900        NaN
 11       NaN       NaN        NaN
 12       NaN     58800    77849.0
 13       NaN     58700   118921.0
 14       NaN     58600   230168.0
 15       NaN     58500   141146.0
 16       NaN     58400   132052.0
 17       NaN     58300   277078.0
 18       NaN     58200   295585.0
 19       NaN     58100   276561.0
 20       NaN     58000   575573.0
 21       NaN     57900   111554.0
 22       NaN       NaN        NaN
 23  420549.0      잔량합계  2236487.0,
          업체명       거래량        전일비
 0       삼성전자   58800.0    상향  200
 1        카카오   73200.0  상향  1,000
 2        솔루엠   20500.0    상향  650
 3       셀트리온  188500.0  상향  3,000
 4        현대차  195500.0  상향  7,000
 5        NaN       NaN        NaN
 6      에이프로젠    1400.0     상향  20
 7      DB하이텍   46300.0  상향  2,900
 8       유한양행   56600.0    상향  600
 9   삼성바이오로..  836000.0  상향  7,000
 10     NAVER  238000.0  상향  4,000,
        업체명       거래량         전일비
 0     소리바다     850.0     상향  455
 1     네이처셀   27250.0   상향  3,750
 2   삼화네트웍스    3215.0     상향  190
 3   우리기술투자    5830.0     상향  220
 4     펄어비스   55900.0   상향  1,800
 5      NaN       NaN         NaN
 6    넥슨게임즈   16800.0     상향  350
 7      덱스터   13700.0     상향  400
 8      새빗켐  173000.0  상향  29,200
 9    이지홀딩스    3655.0      하향  15
 10     인산가    2005.0      상향  15]

In [4]:
frame = pd.DataFrame(np.arange(16).reshape(4,4),
index=['white','black','red','blue'],
columns=['up','down','right','left'])

frame.to_json('frame.json')

In [5]:
pd.read_json('frame.json')

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [13]:
books = [{"writer": "Mark Ross",
         "nationality": "USA",
         "books": [
         {"title": "XML Cookbook", "price": 23.56},
         {"title": "Python Fundamentals", "price": 50.70},
         {"title": "The NumPy library", "price": 12.30}
         ]
        },{"writer": "Barbara Bracket",
         "nationality": "UK",
         "books": [
         {"title": "Java Enterprise", "price": 28.60},
         {"title": "HTML5", "price": 31.35},
         {"title": "Python for Dummies", "price": 28.00}
         ]
        }]

In [7]:
books.to_json('books.json')

In [ ]:
import json
from pandas.io.json import json_normalize

with open('books.json','w') as fout:

In [23]:
with open('books.json', 'w', encoding='UTF-8') as fout:
    fout.write(
        '''
        [{"writer": "Mark Ross",
             "nationality": "USA",
             "books": [
             {"title": "XML Cookbook", "price": 23.56},
             {"title": "Python Fundamentals", "price": 50.70},
             {"title": "The NumPy library", "price": 12.30}
             ]
            },{"writer": "Barbara Bracket",
             "nationality": "UK",
             "books": [
             {"title": "Java Enterprise", "price": 28.60},
             {"title": "HTML5", "price": 31.35},
             {"title": "Python for Dummies", "price": 28.00}
             ]
            }]
        ''')
    
print('파일에 json 쓰기 성공')

파일에 json 쓰기 성공

In [33]:
import json
from pandas import json_normalize

file = open('books.json','r')
text = file.read()
text = json.loads(text)

In [34]:
json_normalize(text,'books')

                 title  price
0         XML Cookbook  23.56
1  Python Fundamentals  50.70
2    The NumPy library  12.30
3      Java Enterprise  28.60
4                HTML5  31.35
5   Python for Dummies  28.00

In [29]:
pd.read_json('books.json')

,writer,nationality,books
0,Mark Ross,USA,"[{'title': 'XML Cookbook', 'price': 23.56}, {'..."
1,Barbara Bracket,UK,"[{'title': 'Java Enterprise', 'price': 28.6}, ..."

In [36]:
from pandas.io.pytables import HDFStore

frame = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['white','black','red','blue'],
                    columns=['up','down','right','left'])

In [46]:
store = HDFStore('mydata.h5')
store['obj1'] = frame
store['obj2'] = frame

frame

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [47]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [44]:
store['obj2']

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

# Pickle - Python Object Serialization

In [49]:
import pickle

data = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=['white','black','red','blue'],
                    columns=['up','down','right','left'])

data

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [53]:
pickled_data = pickle.dumps(data)

print(pickled_data)
type(pickled_data)

b'\x80\x04\x95\xd3\x02\x00\x00\x00\x00\x00\x00\x8c\x11pandas.core.frame\x94\x8c\tDataFrame\x94\x93\x94)\x81\x94}\x94(\x8c\x04_mgr\x94\x8c\x1epandas.core.internals.managers\x94\x8c\x0cBlockManager\x94\x93\x94\x8c\x16pandas._libs.internals\x94\x8c\x0f_unpickle_block\x94\x93\x94\x8c\x15numpy.core.multiarray\x94\x8c\x0c_reconstruct\x94\x93\x94\x8c\x05numpy\x94\x8c\x07ndarray\x94\x93\x94K\x00\x85\x94C\x01b\x94\x87\x94R\x94(K\x01K\x04K\x04\x86\x94h\x0f\x8c\x05dtype\x94\x93\x94\x8c\x02i4\x94\x89\x88\x87\x94R\x94(K\x03\x8c\x01<\x94NNNJ\xff\xff\xff\xffJ\xff\xff\xff\xffK\x00t\x94b\x88C@\x00\x00\x00\x00\x01\x00\x00\x00\x02\x00\x00\x00\x03\x00\x00\x00\x04\x00\x00\x00\x05\x00\x00\x00\x06\x00\x00\x00\x07\x00\x00\x00\x08\x00\x00\x00\t\x00\x00\x00\n\x00\x00\x00\x0b\x00\x00\x00\x0c\x00\x00\x00\r\x00\x00\x00\x0e\x00\x00\x00\x0f\x00\x00\x00\x94t\x94b\x8c\x08builtins\x94\x8c\x05slice\x94\x93\x94K\x00K\x04K\x01\x87\x94R\x94K\x02\x87\x94R\x94\x85\x94]\x94(\x8c\x18pandas.core.indexes.base\x94\x8c\n_new_Index\x94\x93\x94h)\x8c\x05Index\x94\x93\x94}\x94(\x8c\x04data\x94h\x0eh\x11K\x00\x85\x94h\x13\x87\x94R\x94(K\x01K\x04\x85\x94h\x18\x8c\x02O8\x94\x89\x88\x87\x94R\x94(K\x03\x8c\x01|\x94NNNJ\xff\xff\xff\xffJ\xff\xff\xff\xffK?t\x94b\x89]\x94(\x8c\x02up\x94\x8c\x04down\x94\x8c\x05right\x94\x8c\x04left\x94et\x94b\x8c\x04name\x94Nu\x86\x94R\x94h+h-}\x94(h/h\x0eh\x11K\x00\x85\x94h\x13\x87\x94R\x94(K\x01K\x04\x85\x94h6\x89]\x94(\x8c\x05white\x94\x8c\x05black\x94\x8c\x03red\x94\x8c\x04blue\x94et\x94bh?Nu\x86\x94R\x94e\x86\x94R\x94\x8c\x04_typ\x94\x8c\tdataframe\x94\x8c\t_metadata\x94]\x94\x8c\x05attrs\x94}\x94\x8c\x06_flags\x94}\x94\x8c\x17allows_duplicate_labels\x94\x88sub.'

bytes

In [62]:
with open('data.ser', 'wb') as fout:
    fout.write(pickled_data)
    
print('파일에 pickle 쓰기 성공')

파일에 pickle 쓰기 성공

In [65]:
file = open('data.ser','rb')
text = file.read()

nframe = pickle.loads(text)
nframe

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [67]:
from sqlalchemy import create_engine

engine = create_engine("mysql+pymysql://root:ezen@localhost/mydb?charset=utf8mb4")

engine

Engine(mysql+pymysql://root:***@localhost/mydb?charset=utf8mb4)

In [68]:
frame.to_sql('colors', engine)

4

In [69]:
pd.read_sql('colors',engine)

   index  up  down  right  left
0  white   0     1      2     3
1  black   4     5      6     7
2    red   8     9     10    11
3   blue  12    13     14    15

In [70]:
import pymongo

client = MongoClient('localhost', 27017)

ModuleNotFoundError: No module named 'pymongo'

In [71]:
pip install mariadb

Collecting mariadb
  Downloading mariadb-1.1.4-cp39-cp39-win_amd64.whl (191 kB)
Installing collected packages: mariadb
Successfully installed mariadb-1.1.4
Note: you may need to restart the kernel to use updated packages.

In [72]:
import mariadb

conn = mariadb.connect(
    user='root',
    password='ezen',
    host='localhost',
    port=3306,
    database='mydb'
)

conn

In [74]:
emp_df = pd.read_sql_query(sql='SELECT * FROM emp', con = engine)

emp_df

   empno  ename    hiredate   sal
0     11  blake  2022-08-18  3500
1     12  chris  2022-08-18  4000
2     13  james  2022-08-17  3500
3     14  grace  2022-08-05  3600

# F String

In [76]:
name = 'Smith'
f'Hello {name}'
'Hello {}'.format(name)
"Hello %s %s"%(name, ' Good day!')

'Hello Smith  Good day!'

In [97]:
emp_df = pd.read_sql_query(sql="SELECT * FROM emp WHERE empno=%s AND ename='%s'"%(11, 'Blake'), con=engine)

emp_df

   empno  ename    hiredate   sal
0     11  blake  2022-08-18  3500

# Data
- 정형 : SQL DB, EXCEL, CSV
- 비정형 : text, 이미지, 동영상
- 반정형 : xml, json, html : Metadata( <name>Smith</name>

# NoSQL(Not Only SQL)
- Collection  
  ㄴDocument (image, text, video 다 들어갈 수 있는 포괄적인 의미)

In [47]:
import pymongo

client = pymongo.MongoClient("mongodb+srv://ezen:ezen@cluster0.cpnlwe2.mongodb.net/?retryWrites=true&w=majority")
db = client.test
db

Database(MongoClient(host=['ac-pnmkyqb-shard-00-01.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-00.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-02.cpnlwe2.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-9lke85-shard-0', tls=True), 'test')

In [62]:
client['ezen']   # 이 방식을 더 권함

Database(MongoClient(host=['ac-pnmkyqb-shard-00-01.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-00.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-02.cpnlwe2.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-9lke85-shard-0', tls=True), 'ezen')

In [63]:
client.list_database_names()

['ezen', 'admin', 'local']

In [64]:
testdb = client['ezen']

In [65]:
testdb

Database(MongoClient(host=['ac-pnmkyqb-shard-00-01.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-00.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-02.cpnlwe2.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-9lke85-shard-0', tls=True), 'ezen')

In [66]:
testdb.list_collection_names()

['test']

In [67]:
sample_col = testdb['sample']

In [68]:
sample_col

Collection(Database(MongoClient(host=['ac-pnmkyqb-shard-00-01.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-00.cpnlwe2.mongodb.net:27017', 'ac-pnmkyqb-shard-00-02.cpnlwe2.mongodb.net:27017'], document_class=dict, tz_aware=False, connect=True, retrywrites=True, w='majority', authsource='admin', replicaset='atlas-9lke85-shard-0', tls=True), 'ezen'), 'sample')

In [69]:
testdb.list_collection_names()

['test']

In [70]:
mydict = {"name":"Laura", "address":"Seoul"}
x = sample_col.insert_one(mydict)
x.inserted_id

ObjectId('630dc1d9465d1851d6b96205')

# 컬렉션.find() 로 컬렉션 데이터 가져오기

In [91]:
cursor = sample_col.find()
cursor
frame = pd.DataFrame(list(cursor))

frame

                        _id   name address
0  630dc1d9465d1851d6b96205  Laura   Seoul

In [92]:
cursor = sample_col.find()
cursor
frame = pd.DataFrame(list(cursor))

frame.iloc[:,1:3]

x = sample_col.delete_one({'name':'Laura'})
x

In [80]:
for i in cursor:
    print(i['name'])
    print(i['address'])

Laura
Seoul

In [93]:
import pandas as pd
import numpy as np

frame = pd.DataFrame( np.arange(50).reshape(10,-1),
    columns=['white','red','blue','black','green'])
frame

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19
4     20   21    22     23     24
5     25   26    27     28     29
6     30   31    32     33     34
7     35   36    37     38     39
8     40   41    42     43     44
9     45   46    47     48     49

In [94]:
import json

record = json.loads(frame.T.to_json()).values()
record

dict_values([{'white': 0, 'red': 1, 'blue': 2, 'black': 3, 'green': 4}, {'white': 5, 'red': 6, 'blue': 7, 'black': 8, 'green': 9}, {'white': 10, 'red': 11, 'blue': 12, 'black': 13, 'green': 14}, {'white': 15, 'red': 16, 'blue': 17, 'black': 18, 'green': 19}, {'white': 20, 'red': 21, 'blue': 22, 'black': 23, 'green': 24}, {'white': 25, 'red': 26, 'blue': 27, 'black': 28, 'green': 29}, {'white': 30, 'red': 31, 'blue': 32, 'black': 33, 'green': 34}, {'white': 35, 'red': 36, 'blue': 37, 'black': 38, 'green': 39}, {'white': 40, 'red': 41, 'blue': 42, 'black': 43, 'green': 44}, {'white': 45, 'red': 46, 'blue': 47, 'black': 48, 'green': 49}])

In [99]:
x = sample_col.insert_many(record)
x.inserted_ids

[ObjectId('630dcc5f465d1851d6b96206'),
 ObjectId('630dcc5f465d1851d6b96207'),
 ObjectId('630dcc5f465d1851d6b96208'),
 ObjectId('630dcc5f465d1851d6b96209'),
 ObjectId('630dcc5f465d1851d6b9620a'),
 ObjectId('630dcc5f465d1851d6b9620b'),
 ObjectId('630dcc5f465d1851d6b9620c'),
 ObjectId('630dcc5f465d1851d6b9620d'),
 ObjectId('630dcc5f465d1851d6b9620e'),
 ObjectId('630dcc5f465d1851d6b9620f')]

In [108]:
cursor = sample_col.find()

frame = pd.DataFrame(list(cursor))
frame.iloc[:,1:7]

   white  red  blue  black  green
0      0    1     2      3      4
1      5    6     7      8      9
2     10   11    12     13     14
3     15   16    17     18     19
4     20   21    22     23     24
5     25   26    27     28     29
6     30   31    32     33     34
7     35   36    37     38     39
8     40   41    42     43     44
9     45   46    47     48     49

In [111]:
query = {'white':{'$gt':30}}
cursor = sample_col.find(query)
df = pd.DataFrame(list(cursor)).drop('_id', axis=1)

df

   white  red  blue  black  green
0     35   36    37     38     39
1     40   41    42     43     44
2     45   46    47     48     49

In [113]:
cursor = sample_col.find({}).sort('white')   # ASC
cursor = sample_col.find({}).sort('white', -1)   # DESC

In [115]:
query = {'white':{'$gt':30}}
x = sample_col.delete_one(query)
x

x.deleted_count

1

In [116]:
query = {'white':{'$gt':30}}
new_value = {"$set":{"address":"서울시 관악구"}}

x = sample_col.update_one(query, new_value)
x.modified_count

1

In [ ]:
sample_col.drop()   # 컬렉션 삭제

In [ ]:
sample_col.limit(5)  # 다 가져오지 않고 5개만 가져옴